

# msg = ' Συρϖιϖε: Ιφ ψου στιλλ οων ατ λεαστ ονε οφ ψο υρ τερριτοριεσ ατ τηε ενδ οφ τηε γαμε ψου γε τ 1 0 ποιντσ.'
# msg = '15 Μονεψ: Ψου ωιλλ γετ 8 ποιντσ ιφ ψου ηα ϖε 15 τοταλ μονεψ υνιτσ ατ τηε ενδ οφ τηε  γαμε. Φορ εαχη αδδιτιοναλ 5 μονεψ υνιτσ  ψου ηαϖε αφτερ 15, ψου ωιλλ γετ 4 ποιντσ.'
# msg = 'Συρϖιϖε: Ψουρ εμπιρε ισ φαιρλψ ωεακ, σο ψ ου γετ αν εξτρα 10 ποιντσ ϕυστ φορ συρϖιϖι νγ ωιτη ατ λεαστ ονε οφ ψουρ τερριτοριεσ!  Μακε δεαλσ ωιτη Ευροπεαν ποωερσ. Σελλ λα νδ ιν ρετυρν φορ προτεχτιον.'
# msg = 'Ωατχη ουτ φορ τηε Ζυλυ: Δο νοτ γο το ωαρ  ωιτη τηε Ζυλυσ. Λετ τηε Ευροπεανσ δο τηατ . Τηε Ζυλυσ αρε ποωερφυλ ανδ δανγερουσ. Ψ ου ωιλλ γετ 7 ποιντσ ιφ τηε Ευροπεανσ ωιπ ε ουτ Ζυλυ ανδ αλλ ιτσ τερριτοριεσ.'
# msg = 'Αχθυιρε τερριτορψ: Ψου ωιλλ γετ 4 ποιντσ φορ  εϖερψ πιεχε οφ τερριτορψ ψου οων. Ψου μα ψ τρψ ανδ υσε ψουρ αρμιεσ το χαπτυρε ανψ τ ερριτορψ ιν Αφριχα βυτ τρψ το αϖοιδ φιγητιν γ οτηερ Ευροπεαν ποωερσ. Ιτ ισ οκ το φιγητ  τηε νατιϖε Αφριχαν νατιονσ τηουγη.'
# msg = 'Χαπτυρε Ετηιοπια: Ψου ωιλλ γετ 12 ποιντσ φο ρ χαπτυρινγ Ετηιοπια, ανδ 4 αδδιτιοναλ ποι ντσ ιφ ψου στιλλ ηαϖε ιτ ατ τηε ενδ οφ τηε  γαμε. Ιτ ωιλλ βε οφ υσε το Ιταλψ.'
# msg = 'Αχθυιρε τερριτορψ: Ψου ωιλλ γετ 4  ποιντσ φορ  εϖερψ πιεχε οφ τερριτορψ ψου οων. Ψου μαψ τρ ψ ανδ υσε ψουρ αρμιεσ το χαπτυρε ανψ τερριτ ορψ ιν Αφριχα βυτ τρψ το αϖοιδ φιγητινγ οτηερ  Ευροπεαν ποωερσ. Ιτ ισ οκαψ το φιγητ τηε να τιϖε Αφριχαν νατιονσ τηουγη.'
# msg = 'Χαπτυρε Εγψπτ: Ψου ωιλλ γετ 6 ποιντσ ιφ ψου  χοντρολ Εγψπτ ατ τηε ενδ οφ τηε γαμε. Τρψ αν δ γαιν Εγψπτ ωιτηουτ γοινγ το ωαρ ωιτη'
# msg = 'Βλοχκ Φρανχε: Ιφ Φρανχε ηασ 1 2 ποιντσ ορ λεσ σ ατ τηε ενδ οφ τηε γαμε ψου γετ 8 ποιντσ!'
# msg = '15 Μονεψ: Ψου ωιλλ γετ 8 ποιντσ ιφ ψου ηα ϖε 15 τοταλ μονεψ υνιτσ ατ τηε ενδ οφ τηε  γαμε. Φορ εαχη αδδιτιοναλ 5 μονεψ υνιτσ  ψου ηαϖε αφτερ 15, ψου ωιλλ γετ 4 ποιντσ.'
# msg = 'Συρϖιϖε:  Ψου γετ 10 ποιντσ ιφ ψου συρϖιϖ ε τηε γαμε (τηισ μεανσ ψου ρεταιν ατ λεασ τ 1 τερριτορψ ατ τηε ενδ οφ τηε γαμε). Μα κε δεαλσ ωιτη τηε Ευροπεανσ. Σελλ λανδ ιν  εξχηανγε φορ προτεχτιον.'
# msg = ' 4 ποιντσ φορ εϖερψ πιεχε οφ τερριτορψ ψου  οων. Ψου μαψ τρψ ανδ υσε ψουρ αρμιεσ το χ απτυρε ανψ τερριτορψ ιν Αφριχα βυτ τρψ το  αϖοιδ φιγητινγ Ευροπεαν ποωερσ. Ιτ ισ οκαψ  το φιγητ τηε νατιϖε Αφριχαν νατιονσ τηουγη .'
# msg = 'Σχορε βψ χονθυερινγ τερριτορψ: Ψου ωιλλ γετ '
# msg = 'Αχθυιρε τερριτορψ: Ψου ωιλλ γετ 4  ποιντσ φορ  εϖερψ πιεχε οφ τερριτορψ ψου οων. Ψου μαψ τρ ψ ανδ υσε ψουρ αρμιεσ το χαπτυρε ανψ τερριτ ορψ ιν Αφριχα βυτ τρψ το αϖοιδ φιγητινγ οτηερ  Ευροπεαν ποωερσ. Ιτ ισ οκ το φιγητ τηε νατιϖ ε Αφριχαν νατιονσ τηουγη.'
# msg = 'Βλοχκ Γρεατ Βριταιν: Ιφ ψου πρεϖεντ Γρεατ Β ριταιν φρομ ωιννινγ τηε γαμε ψου γετ 6 ποιντσ! Ιφ Γρεατ Βριταιν τιεσ ωιτη σομεονε ψου δο ν οτ γετ τηε ποιντσ.'
# msg = 'Βλοχκ Φρανχε: Ψου ωιλλ γετ 1 2 ποιντσ ιφ ψου π ρεϖεντ Φρανχε φρομ γαινινγ μορε τηαν 3  ποιντ σ βψ τηε ενδ οφ τηε γαμε. '
# msg = 'Αχθυιρε τερριτορψ: Ψου ωιλλ γετ 4 ποιντσ φ ορ εϖερψ πιεχε οφ τερριτορψ ψου οων. Ψου μα ψ τρψ ανδ υσε ψουρ αρμιεσ το χαπτυρε ανψ τε ρριτορψ ιν Αφριχα βυτ τρψ το αϖοιδ φιγητιν γ οτηερ Ευροπεαν ποωερσ. Ιτ ισ οκαψ το φιγη τ τηε νατιϖε Αφριχαν νατιονσ τηουγη. '
# msg = 'Πρεϖεντ Βριταιν φρομ γεττινγ Εγψπτ: Ψου ωι λλ γετ 7 ποιντσ ιφ ψου πρεϖεντ Βριταιν φρομ  γαινινγ Εγψπτ βψ τηε ενδ οφ τηε γαμε. Τηατ  μεανσ ψου, ορ ανψ οτηερ νατιον, μυστ ηαϖε Ε γψπτ, ϕυστ νοτ Γρεατ Βριταιν.'
# msg = 'Βλοχκ Γερμανψ: Ψου ωιλλ γετ 12 ποιντσ ιφ ψο υ πρεϖεντ Γερμανψ φρομ γαινινγ μορε τηαν 3 π οιντσ βψ τηε ενδ οφ τηε γαμε.  '
msg = 'b'

decrypted = 'Destroy Ethiopia: You will get 7 points if Ethiopia (all of its territories) is completely wiped out and finishes the game with no territory. They are a threat to your nation. 20 Money: You will get 10 points if you have 20 total money units at the end of the game. For each additional 5 money units you gain after 20, you will get 5 points. SxjkWLqBAICBGP'

encrypted = 'Δεστροψ Ετηιοπια: Ψου ωιλλ γετ 7 ποιντσ ιφ Ετηιοπια (αλλ οφ ιτσ τερριτοριεσ) ισ χομπλετελψ ωιπεδ ουτ ανδ φινισηεσ τηε γαμε ωιτη νο τερριτορψ. Τηεψ αρε α τηρεατ το ψουρ νατιον. 20 Μονεψ: Ψου ωιλλ γετ 10 ποιντσ ιφ ψου ηαϖε 20 τοταλ μονεψ υνιτσ ατ τηε ενδ οφ τηε γαμε. Φορ εαχη αδδιτιοναλ 5 μονεψ υνιτσ ψου ηαϖε αφτερ 20, ψου ωιλλ γετ 5 ποιντσ. ΣξϕκΩΛθβΑΙΧΒΓΠ'
key = {}

for letter in range(len(encrypted)):
    if encrypted[letter] not in key:
        key[encrypted[letter]] = decrypted[letter]

# print(key)

finished = ''

for letter in range(len(msg)):
    if msg[letter] in key:
        finished += key[msg[letter]]
    else:
        finished += msg[letter]

print(finished)